In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({"x" : [1, 3, 5, 7], "y" : [2, 4, 6, 8]})

In [3]:
df1

   x  y
0  1  2
1  3  4
2  5  6
3  7  8

In [5]:
# 1.1. append single row of data into dataframe
pd.concat([df1, pd.DataFrame([{ 'x': 9, "y" : 10}])])

   x   y
0  1   2
1  3   4
2  5   6
3  7   8
0  9  10

In [6]:
# 1.2. append new dataframe into existing dataframe
df2 = pd.DataFrame({"x" : [11, 13, 15, 17], "y" : [12, 14, 16, 18]})
new_df = pd.concat([df1, df2], ignore_index = True)
new_df

    x   y
0   1   2
1   3   4
2   5   6
3   7   8
4  11  12
5  13  14
6  15  16
7  17  18

In [7]:
# 2.1. sort dataframe (ascending)
new_df.sort_index()

    x   y
0   1   2
1   3   4
2   5   6
3   7   8
4  11  12
5  13  14
6  15  16
7  17  18

In [8]:
# 2.2. sort dataframe (descending)
new_df.sort_index(ascending = False)

    x   y
7  17  18
6  15  16
5  13  14
4  11  12
3   7   8
2   5   6
1   3   4
0   1   2

In [9]:
# 3.1. filtering dataframe (double digits)
double_digits = (new_df["x"] >= 10) | (new_df["y"] >= 10)
new_df.loc[double_digits]

    x   y
4  11  12
5  13  14
6  15  16
7  17  18

In [10]:
# 3.2. filering dataframe (single digits)
single_digits = (new_df["x"] < 10) | (new_df["y"] < 10)
new_df.loc[single_digits]

   x  y
0  1  2
1  3  4
2  5  6
3  7  8

In [12]:
# 4. create empty dataframe
empty_df = pd.DataFrame()

In [13]:
# 5. write function that takes in 4 int variables and append into dataframe
people_details = {
    "name" : ["Jane Doe", "Peter Smith", "Morgan Green"],
    "height" : ["170", "189", "167"],
    "weight" : ["60", "75", "59"],
    "age" : ["23", "25", "20"]
}
df3 = pd.DataFrame(people_details)
df3

           name height weight age
0      Jane Doe    170     60  23
1   Peter Smith    189     75  25
2  Morgan Green    167     59  20

In [14]:
df3.set_index("name", inplace = True)

In [15]:
df3

             height weight age
name
Jane Doe        170     60  23
Peter Smith     189     75  25
Morgan Green    167     59  20

In [16]:
def people_details(name, height, weight, age):
    df3 = pd.DataFrame(people_details)
    people_df = pd.DataFrame({"name" : "", "height" : "", "weight" : "", "age" : ""})
    return pd.DataFrame(people_details)

In [19]:
people_details("Amy", 163, 55, 21)

ValueError: DataFrame constructor not properly called!

In [ ]:
def people_details(name, height, weight, age):
    people_details = {
        "name" : "Name: ", #["Jane Doe", "Peter Smith", "Morgan Green"],
        "height" : "Height: ", #["170", "189", "167"],
        "weight" : "Weight: ", #["60", "75", "59"],
        "age" : "Age: " #["23", "25", "20"]
    }
    df3 = pd.DataFrame(people_details)
    df3.set_index("name", inplace = True)
    df3_new = pd.concat([df3, pd.DataFrame(people_details)])
    return df3_new

In [22]:
people_details = {
        "name" : "Name: ", #["Jane Doe", "Peter Smith", "Morgan Green"],
        "height" : "Height: ", #["170", "189", "167"],
        "weight" : "Weight: ", #["60", "75", "59"],
        "age" : "Age: " #["23", "25", "20"]
    }
df3 = pd.DataFrame([people_details])

In [23]:
df3

     name    height    weight    age
0  Name:   Height:   Weight:   Age:

In [ ]:
name = "Amy" #input("Name: ")
height = "163" #input("Height: ")
weight = "55" #input("Weight: ")
age = "21" #input("Age: ")
print(people_details)

In [27]:
def people_data(name, height, weight, age):
    series1 = pd.Series(name)
    series2 = pd.Series(height)
    series3 = pd.Series(weight)
    series4 = pd.Series(age)
    
    df = pd.concat([series1, series2, series3, series4], axis = 1)
    
    return df

In [28]:
people_data("Amy", 162, 55, 21)

     0    1   2   3
0  Amy  162  55  21